```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.gke.google_container_cluster.primary: Refreshing state... [id=projects/bngo-app/locations/europe-west1-c/clusters/tpv-gke-cluster]
module.gke.google_container_node_pool.primary_preemptible_nodes: Refreshing state... [id=projects/bngo-app/locations/europe-west1-c/clusters/tpv-gke-cluster/nodePools/tpv-node-pool]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service_account.google_service_account.sa_deployment will be created
  + resource "google_service_account" "sa_deployment" {
      + account_id   = "service-account-tpv"
      + display_name = "A service account for Github actions deployment"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.service_account.google_service_account_iam_binding.cloud-run-admin-iam will be created
  + resource "google_service_account_iam_binding" "cloud-run-admin-iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/run.admin"
      + service_account_id = (known after apply)
    }

  # module.service_account.google_service_account_iam_binding.kubernetes-engine-developer-iam will be created
  + resource "google_service_account_iam_binding" "kubernetes-engine-developer-iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/container.developer"
      + service_account_id = (known after apply)
    }

  # module.service_account.google_service_account_iam_binding.serviceaccountuser-iam will be created
  + resource "google_service_account_iam_binding" "serviceaccountuser-iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.service_account.google_service_account_iam_binding.storage-admin-iam will be created
  + resource "google_service_account_iam_binding" "storage-admin-iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/storage.admin"
      + service_account_id = (known after apply)
    }

  # module.service_account.google_service_account_iam_binding.viewer-iam will be created
  + resource "google_service_account_iam_binding" "viewer-iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/viewer"
      + service_account_id = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```